/*
Css 主要概念

文件流
盒模型
块级元素 行内元素
布局
对齐  水平  垂直  居中
bfc
脱离文档流  float
浏览器的适配   分辨率的适配  屏幕大小的适配  手机端  电脑端的适配
动画
三维


todo
滚动条的样式
line-height





*Css 的疑问
有些属性 需要配合使用  比如  left  right    跟position  或者 跟float  配合生效
几个值的  合并值
float  碰到什么会停止
是否继承

是否有默认值
如果 父级 没有高度  会不会 再向上找

 属性 是否 只需要设置 一次就好  还是需要 每层每层都设置 ？
 box-sizing
 默认值 有哪些？

less 必须是 结构化的吗  怎么选中 非结构的或者 选中 更大范围的元素  应该怎么选择？？





确定的
min-height  设置最小高度，下级的属性不会继承
height  不会跨层 继承  之后根据父级的来
如果设置了 按设置的了 如果没有设置 会被子级撑大

box-sizing  不包括外边距

父元素 如果不设置 overflow  子元素 会溢出

图片 只需要 需要 设置 宽  高 的 一边  就会成比例 变化


*
*
* */
